## [View Run #17 ](https://github.com/NicholasBatesNZ/mcserver/actions/runs/7304208298)

| Summary       | Result        |
| ------------- |:-------------:|
| 🚀 Run         | [View Run - 17](https://github.com/NicholasBatesNZ/mcserver/actions/runs/7304208298) |
| 🖌 Format and Style  | ✅  |
| ⚙️ Initialization  | ✅ |
| 🤖 Validation    | ✅ |
| 📖 Plan     | ✅    |

<details><summary>🤖 Validation Output</summary>

```hcl
Success! The configuration is valid.


```

</details>

#### 📖Terraform Plan - ✅

<details><summary>Show Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_role.lambda_execution_role_run_task will be created
  + resource "aws_iam_role" "lambda_execution_role_run_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "LambdaExecutionRoleRunTask"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "creator" = "mcdocker"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.lambda_execution_role_basic_policy_run_task will be created
  + resource "aws_iam_role_policy_attachment" "lambda_execution_role_basic_policy_run_task" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "LambdaExecutionRoleRunTask"
    }

  # aws_iam_role_policy_attachment.lambda_execution_role_basic_policy_run_task_admin will be created
  + resource "aws_iam_role_policy_attachment" "lambda_execution_role_basic_policy_run_task_admin" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "LambdaExecutionRoleRunTask"
    }

  # aws_lambda_function.run_task will be created
  + resource "aws_lambda_function" "run_task" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "lambda_sources/run_task.zip"
      + function_name                  = "RunTask"
      + handler                        = "run_task.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.11"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "usad+qzDFM9nLkD5lsdI54xoyTQYGimY1hbYr7C7PI4="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "creator" = "mcdocker"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "TASK_ROLE_ARN" = "arn:aws:iam::251780365797:role/TaskExecutionRoleECS"
            }
        }
    }

  # aws_launch_template.template will be updated in-place
  ~ resource "aws_launch_template" "template" {
      ~ default_version         = 18 -> (known after apply)
        id                      = "lt-0e2348d0990753768"
      ~ image_id                = "ami-0a9c3253d726d6951" -> "ami-02852397808ce075c"
      ~ latest_version          = 18 -> (known after apply)
        name                    = "ECSLaunchTemplate_XeE76TS1Wgbt"
        tags                    = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 1 to change, 0 to destroy.

```
</details>

- [ ] Plan Reviewed

*Author: @NicholasBatesNZ, Action: `pull_request`, Workflow: `Validate Terraform`*
<!-- Sticky Pull Request CommentChange Summary -->